[
    
        {
          "id": 1,
          "courseName": "How to Change a Tire | Change a flat car tire step by step",
          "description": "Nothing takes the joy out of a road trip like a flat tire. Do you know how to change it? We didn  t, but we've learned from Allan Stanley of AAA. Download this video to your mobile phone just in case. This video is a step by step guide on how to change a flat tire on your car",
          "duration": 337,
          "videoUrl": "https://www.youtube.com/watch?v=joBmbh0AGSQ&ab_channel=Howdini",
          "imageUrl": "https://i.ytimg.com/vi/joBmbh0AGSQ/sddefault.jpg",
          "views": 3020,
          "ratings": 4.2,
          "procedure": "Steps:\r\n1. Park your car on a flat, stable surface and engage the parking brake. Turn on hazard lights if you're on the roadside, and place wheel wedges on the opposite end of the tire you're changing.\r\n2. Locate your spare tire, jack, and lug wrench from your car's trunk or storage area. Place the jack under the designated lifting point nearest to the flat tire - check your owner's manual for exact location.\r\n3. Use the lug wrench to loosen the lug nuts on the flat tire by turning them counterclockwise, but don't remove them completely yet. Do this while the tire is still on the ground for easier leverage.\r\n4. Raise the car with the jack until the flat tire is completely off the ground, about 6 inches up. Make sure the car is stable and the jack is properly positioned.\r\n5. Remove the loosened lug nuts completely and take off the flat tire. Remember to place lug nuts in a secure location where they won't roll away.\r\n6. Mount the spare tire onto the wheel hub, aligning the holes with the wheel studs. Replace the lug nuts and tighten them by hand in a star pattern.\r\n7. Lower the car back down until the spare tire touches the ground but the car's weight isn't fully on it. Tighten the lug nuts completely with the wrench in a star pattern.\r\n8. Lower the car completely and remove the jack. Double-check all lug nuts for tightness. Store the flat tire and all tools back in your car.\r\n9. Drive at the recommended speed limit for your spare tire (usually under 50 mph) and get your flat tire repaired or replaced as soon as possible.",
          "CategoryId": 3
        },
        {
          "id": 2,
          "courseName": "How to Fix Annoying Wiper Chatter on Windshield - EASY!",
          "description": "Today we cover why your windshield wipers chatter or skip when in use. A lot of people run into this despite their wipers being new and their windshield being clean. But there is a way to fix it with ease!",
          "duration": 280,
          "videoUrl": "https://www.youtube.com/watch?v=w0I-obFmADE",
          "imageUrl": "https://i.ytimg.com/vi/w0I-obFmADE/maxresdefault.jpg",
          "views": 3332706,
          "ratings": 4.5,
          "procedure": "Steps:\r\n1. Clean the damaged area thoroughly using glass cleaner and a microfiber cloth. Make sure to remove all dirt, debris, and loose glass particles from the crack or chip.\r\n2. Dry the area completely using a hairdryer on low heat setting or a clean microfiber cloth. Any moisture can prevent proper adhesion of the repair resin.\r\n3. Apply the windshield repair kit adhesive disc over the damaged area. Center it directly over the chip or crack. Make sure it creates a good seal against the glass.\r\n4. Attach the resin applicator to the adhesive disc according to your repair kit's instructions. Most kits use a syringe-like applicator that screws into the disc.\r\n5. Fill the applicator with the repair resin provided in your kit. Inject the resin into the damage by applying pressure on the applicator. You may need to alternate between pressure and release to remove air bubbles.\r\n6. Let the resin cure according to the kit instructions, usually about 5-10 minutes. Keep the car out of direct sunlight during this time as UV light can cause premature curing.\r\n7. Remove the applicator and adhesive disc carefully. There will likely be excess resin on the surface of the glass.\r\n8. Apply the curing strips provided in your kit over the repair and park the car in direct sunlight for about 15 minutes, or use the UV curing light if included in your kit.\r\n9. Once fully cured, use the razor blade from your kit to carefully scrape away excess resin. Clean the area one final time with glass cleaner.\r\n10. Note: If the crack is longer than a dollar bill or directly in the driver's line of sight, professional replacement is recommended instead of DIY repair.",
          "CategoryId": 3
        },
        {
          "id": 3,
          "courseName": "Quick DIY table / desk",
          "description": "We needed a desk in a hurry.  So we built one from the scraps of wood we had.  It's not the prettiest, but it did the job",
          "duration": 165,
          "videoUrl": "https://www.youtube.com/watch?v=Mi3rLzwkoBs&ab_channel=DavidMcLuckie",
          "imageUrl": "https://i.ytimg.com/vi/Mi3rLzwkoBs/maxresdefault.jpg",
          "views": 18900,
          "ratings": 3.5,
          "procedure": "Steps:\r\n1. Prepare your materials and workspace. Gather wooden planks for tabletop (preferably hardwood), four legs, support beams, wood screws, wood glue, measuring tape, circular saw, drill, sandpaper, and wood finish.\r\n2. Measure and cut the wooden planks for your tabletop. For a standard dining table, cut planks to 60 inches length and arrange them to achieve 36 inches width. Make sure all cuts are straight and even.\r\n3. Align the planks side by side and connect them using wood glue. Clamp them together tightly and let dry for 24 hours. For added strength, use dowel joints between planks.\r\n4. Cut four support beams (aprons) that will connect the legs to the tabletop. For a 60-inch table, cut two 54-inch pieces for the sides and two 30-inch pieces for the ends.\r\n5. Cut table legs to desired height (typically 29 inches for dining tables). If using pre-made legs, skip this step. Sand all pieces thoroughly, starting with coarse-grit sandpaper and finishing with fine-grit.\r\n6. Attach the aprons to the legs using wood glue and screws. Create a rectangular frame, ensuring all corners are at 90-degree angles. Use corner brackets for added stability.\r\n7. Flip the tabletop upside down and center the leg assembly on it. Attach the frame to the tabletop using screws through the aprons. Pre-drill holes to prevent wood splitting.\r\n8. Fill any gaps or screw holes with wood filler and let dry. Sand the entire table smooth, paying special attention to edges and joints.\r\n9. Apply wood stain if desired, following the grain direction. Let dry completely according to product instructions.\r\n10. Finish with 2-3 coats of polyurethane for protection, sanding lightly between coats. Let the final coat cure for at least 24 hours before use.",
          "CategoryId": 1
        },
        {
          "id": 4,
          "courseName": "RAGE-FIXing my Office Chair",
          "description": "I was going to put this in my Mehditation channel, but then... maybe the art of RAGE-FIXING is technical enough to be in my technical channel!!",
          "duration": 237,
          "videoUrl": "https://www.youtube.com/watch?v=LUcT7DERvHc&ab_channel=ElectroBOOM",
          "imageUrl": "https://i.ytimg.com/vi/LUcT7DERvHc/maxresdefault.jpg",
          "views": 513000,
          "ratings": 4.7,
          "procedure": "Steps:\r\n1. Inspect all parts of the chair to find the source of wobbling. Make sure to carefully check the joints of chair legs, backrest, and seat.\r\n2. Tighten all loose screws using the appropriate screwdriver (Phillips or flathead). If screws are worn out, replace them with new ones of the same size.\r\n3. Check the condition of glue on wooden joints. If joints are separated, clean old glue residue using coarse sandpaper (no. 60) until the surface is clean.\r\n4. Apply strong wood glue (such as epoxy or white PVAc glue) to the separated joints. Ensure glue is evenly spread across the entire surface.\r\n5. Press the joints together and clamp using C-clamps or F-clamps for at least 4 hours until the glue is completely dry. Clean any excess glue with a damp cloth.\r\n6. After the glue dries, remove the clamps and check the joint strength by gently rocking the chair. If there's still wobbling, repeat the process from step 1.\r\n7. For best results, add wooden triangular brackets to each corner of the chair leg joints. Secure them using glue and screws to reinforce the structure.",
          "CategoryId": 1
        },
        {
          "id": 5,
          "courseName": "How To Install Rough In Electricity In A New Construction House - Beginners Guide To Electrical",
          "description": "In this video I will show you how to install rough in electricity in a new construction house. This is how to do wire a new construction house for beginners. I go over the 6-12 rule for receptacle or outlet code. Roughing in house for electricity is something that will be inspected so be to follow your local electrical codes. ",
          "duration": 1820,
          "videoUrl": "https://www.youtube.com/watch?v=1D5OqJ5SF_I&ab_channel=TheExcellentLaborer",
          "imageUrl": "https://i.ytimg.com/vi/1D5OqJ5SF_I/maxresdefault.jpg",
          "views": 375413,
          "ratings": 4.0,
          "procedure": "Steps:\r\n1. Turn off the main power supply at the circuit breaker box. Use a voltage tester to confirm power is completely off before starting any electrical work.\r\n2. Plan your electrical layout. Mark locations for outlets, switches, and light fixtures on the walls. Standard height is 12 inches from floor for outlets and 48 inches for switches.\r\n3. Install the main electrical panel box if not already present. Mount it securely to wall studs and ensure it's properly grounded. This should be done by a certified electrician.\r\n4. Run electrical cables through the walls or ceiling. Use 14-gauge wire for 15-amp circuits (lights, outlets) and 12-gauge for 20-amp circuits (kitchen, heavy appliances). Secure cables every 4-6 feet with staples.\r\n5. Install plastic electrical boxes for outlets and switches. Mount them to wall studs, ensuring they're flush with the finished wall surface. Use proper box sizes based on number of wires.\r\n6. Connect wires to outlets and switches. Strip wire ends carefully, connect black (hot) wires to brass screws, white (neutral) to silver screws, and green/bare copper (ground) to green ground screws.\r\n7. Install ceiling electrical boxes for light fixtures. Ensure they're properly supported to hold fixture weight. Connect wires following the same color coding as outlets.\r\n8. Label all circuits clearly in the main panel box. Install proper size circuit breakers for each circuit (15 or 20 amp as needed).\r\n9. Before restoring power, double-check all connections are tight and wires are properly capped. No bare wire should be exposed.\r\n10. IMPORTANT: If you're not experienced with electrical work, many steps should be performed by a licensed electrician. Incorrect installation can cause fire hazards or violate local building codes.",
          "CategoryId": 2
        },
        {
          "id": 6,
          "courseName": "How To Add An Outlet To A Finished Wall",
          "description": "I will walk you through the process of adding an outlet to an existing circuit without going up to the attic or down to the basement.  This also will make it so you will have no drywall repair or painting to do after the installation.  ",
          "duration": 630,
          "videoUrl": "https://www.youtube.com/watch?v=nWfEANZOYSk&list=PLj9rGlCZDWK6DWA5oUHjJHtmteQUTUyZj&ab_channel=EverydayHomeRepairs",
          "imageUrl": "https://i.ytimg.com/vi/nWfEANZOYSk/hq720.jpg?sqp=-oaymwEhCK4FEIIDSFryq4qpAxMIARUAAAAAGAElAADIQj0AgKJD&rs=AOn4CLAEJXQtojR3OKc5O7HmGHE_WfRT-Q",
          "views": 256300,
          "ratings": 3.6,
          "procedure": "Steps:\r\n1. Turn off power at the main circuit breaker and verify with a voltage tester that power is completely off to the area where you'll be working. Double-check with the tester on nearby outlets.\r\n2. Mark the location for your new outlet. Standard height is 12 inches from the floor to the bottom of the box. Use a stud finder to locate wall studs and mark their positions.\r\n3. Hold the electrical box against the wall and trace its outline. Cut the drywall opening carefully using a drywall saw. Make sure the hole is just large enough for the box to fit snugly.\r\n4. Run electrical cable (14/2 for 15-amp circuit or 12/2 for 20-amp) from the power source to your new outlet location. If fishing wire through walls, use a fish tape to help guide the cable.\r\n5. Insert the cable through the back or side knockout hole of the electrical box. Leave about 8 inches of wire extending into the box for connections. Secure the box to the stud using screws.\r\n6. Strip the outer cable sheath back about 6 inches. Then strip about 3/4 inch of insulation from the individual black and white wires using wire strippers.\r\n7. Connect wires to the outlet: black (hot) wire to brass screws, white (neutral) wire to silver screws, and bare copper (ground) wire to green ground screw. Form hooks in the wire ends with pliers and wrap clockwise around screws.\r\n8. Carefully fold wires into the box and mount the outlet. Secure it with the mounting screws at top and bottom. Ensure it's straight and flush with the wall.\r\n9. Install the cover plate over the outlet, making sure it sits flat against the wall with no gaps.\r\n10. CAUTION: Only turn power back on after all connections are secure and the outlet is fully installed. Test the outlet with a circuit tester to verify proper wiring.\r\n11. Important Safety Note: If you're not experienced with electrical work, hire a licensed electrician. Improper installation can create fire hazards or shock risks.",
          "CategoryId": 2
        },
        {
            "id": 7,
            "courseName": "GODO diaphragm pump assembly.",
            "description": "You can observe the composition of a GODO diaphragm pump visually via this video.",
            "duration": 60,
            "videoUrl": "https://www.youtube.com/watch?v=P-O9ptTAggE",
            "imageUrl": "https://i.ytimg.com/vi/P-O9ptTAggE/sddefault.jpg?sqp=-oaymwEmCIAFEOAD8quKqQMa8AEB-AHUBoAC3gOKAgwIABABGGUgZShlMA8=&rs=AOn4CLDTKeFeYARMRaHy_d4ZcTIyYt9DpA",
            "views": 2067053,
            "ratings": 4.0,
            "procedure": "Steps:\r\n1. Shut off the main water supply valve to your home or the isolation valve closest to the damaged pipe. Open nearby faucets to drain remaining water from the pipes.\r\n2. Clean and dry the area around the leak thoroughly. For copper pipes, use steel wool to clean the pipe surface until it's shiny. For PVC, clean with a dry cloth to remove dirt and moisture.\r\n3. Determine the type of repair needed based on damage: Use epoxy putty for small holes, pipe clamps for cracks, or cut and replace for severe damage. For this procedure, we'll focus on replacing a section.\r\n4. Measure and mark the damaged section to be removed. Allow extra length on both sides to ensure a clean repair. Cut the marked section using a pipe cutter for copper or a hacksaw for PVC.\r\n5. Measure the gap and cut a new piece of pipe about 1/2 inch shorter than the gap. This allows room for coupling fittings on both ends.\r\n6. For copper pipes: Clean all cut ends with emery cloth. Apply flux to the outside of the pipe ends and inside of the couplings. Heat joints with a torch and apply solder.\r\n7. For PVC pipes: Clean all ends with PVC primer. Apply PVC cement to both the pipe ends and inside of the couplings. Push pieces together immediately and hold for 30 seconds.\r\n8. Let the repair cure according to product instructions (usually 30 minutes for PVC cement, 2 hours for solder joints). Do not restore water pressure until fully cured.\r\n9. Turn the water back on slowly and check for leaks. Have towels ready just in case. Watch the repair area for several minutes.\r\n10. If no leaks appear, turn on faucets to release trapped air from the lines. Check the repair again after 24 hours.\r\n11. Note: For main water lines or complex repairs, it's recommended to contact a licensed plumber.",
            "CategoryId": 4
          },
          {
            "id": 8,
            "courseName": "Push & Connect fittings, how to use and install",
            "description": "How to install push ´n´ connect push fit fittings to PEX, copper or CPBC pipes",
            "duration": 120,
            "videoUrl": "https://www.youtube.com/watch?v=Yz5VDrOkAgE",
            "imageUrl": "https://i.ytimg.com/vi/Yz5VDrOkAgE/maxresdefault.jpg",
            "views": 83402,
            "ratings": 3.8,
            "procedure": "Steps:\r\n1. Shut off the main water supply valve to your home or the isolation valve closest to the damaged pipe. Open nearby faucets to drain remaining water from the pipes.\r\n2. Clean and dry the area around the leak thoroughly. For copper pipes, use steel wool to clean the pipe surface until it's shiny. For PVC, clean with a dry cloth to remove dirt and moisture.\r\n3. Determine the type of repair needed based on damage: Use epoxy putty for small holes, pipe clamps for cracks, or cut and replace for severe damage. For this procedure, we'll focus on replacing a section.\r\n4. Measure and mark the damaged section to be removed. Allow extra length on both sides to ensure a clean repair. Cut the marked section using a pipe cutter for copper or a hacksaw for PVC.\r\n5. Measure the gap and cut a new piece of pipe about 1/2 inch shorter than the gap. This allows room for coupling fittings on both ends.\r\n6. For copper pipes: Clean all cut ends with emery cloth. Apply flux to the outside of the pipe ends and inside of the couplings. Heat joints with a torch and apply solder.\r\n7. For PVC pipes: Clean all ends with PVC primer. Apply PVC cement to both the pipe ends and inside of the couplings. Push pieces together immediately and hold for 30 seconds.\r\n8. Let the repair cure according to product instructions (usually 30 minutes for PVC cement, 2 hours for solder joints). Do not restore water pressure until fully cured.\r\n9. Turn the water back on slowly and check for leaks. Have towels ready just in case. Watch the repair area for several minutes.\r\n10. If no leaks appear, turn on faucets to release trapped air from the lines. Check the repair again after 24 hours.\r\n11. Note: For main water lines or complex repairs, it's recommended to contact a licensed plumber.",
            "CategoryId": 4
          },
          {
            "id": 9,
            "courseName": "15 woodworking basics you should know",
            "description": "There are basic concepts in woodworking that you just sort of pick up along your journey as a woodworker. Fundamentals that no one really talks about because they're just so ingrained that they've become second nature. Well, today I'm sharing 15 woodworking basics that I think every woodworker should know.",
            "duration": 780,
            "videoUrl": "https://www.youtube.com/watch?v=m3CqH4DjVlI",
            "imageUrl": "https://i.ytimg.com/vi/m3CqH4DjVlI/maxresdefault.jpg",
            "views": 1189496,
            "ratings": 4.3,
            "procedure": "Steps:\r\n1. Prepare your materials and workspace. Gather wooden planks for tabletop (preferably hardwood), four legs, support beams, wood screws, wood glue, measuring tape, circular saw, drill, sandpaper, and wood finish.\r\n2. Measure and cut the wooden planks for your tabletop. For a standard dining table, cut planks to 60 inches length and arrange them to achieve 36 inches width. Make sure all cuts are straight and even.\r\n3. Align the planks side by side and connect them using wood glue. Clamp them together tightly and let dry for 24 hours. For added strength, use dowel joints between planks.\r\n4. Cut four support beams (aprons) that will connect the legs to the tabletop. For a 60-inch table, cut two 54-inch pieces for the sides and two 30-inch pieces for the ends.\r\n5. Cut table legs to desired height (typically 29 inches for dining tables). If using pre-made legs, skip this step. Sand all pieces thoroughly, starting with coarse-grit sandpaper and finishing with fine-grit.\r\n6. Attach the aprons to the legs using wood glue and screws. Create a rectangular frame, ensuring all corners are at 90-degree angles. Use corner brackets for added stability.\r\n7. Flip the tabletop upside down and center the leg assembly on it. Attach the frame to the tabletop using screws through the aprons. Pre-drill holes to prevent wood splitting.\r\n8. Fill any gaps or screw holes with wood filler and let dry. Sand the entire table smooth, paying special attention to edges and joints.\r\n9. Apply wood stain if desired, following the grain direction. Let dry completely according to product instructions.\r\n10. Finish with 2-3 coats of polyurethane for protection, sanding lightly between coats. Let the final coat cure for at least 24 hours before use.",
            "CategoryId": 1
          },
          {
            "id": 10,
            "courseName": "How To Make Your Car Last A Long Time - Simple Checks",
            "description": "The best way to keep your car in great shape is to regularly check the vehicle and keep up with preventative maintenance. This video will outline simple checks you can make on your car. The more frequent you check things like tire pressure and engine oil the better, but it's good to check all of the items in the video at the very least twice a year. We'll look at three main sections in this video. First we'll discuss tires, brakes, and suspension. Next we'll look under the hood and look at fluids and filters. Finally we'll look at exterior checks such as lights and wipers. Catching any issues early can help you make sure your vehicle lasts as long as possible.",
            "duration": 360,
            "videoUrl": "https://www.youtube.com/watch?v=Y3jcQCdeJAs",
            "imageUrl": "https://i.ytimg.com/vi/Y3jcQCdeJAs/maxresdefault.jpg",
            "views": 2330400,
            "ratings": 5.0,
            "procedure": "Steps:\r\n1. Park your car on a flat, stable surface and engage the parking brake. Turn on hazard lights if you're on the roadside, and place wheel wedges on the opposite end of the tire you're changing.\r\n2. Locate your spare tire, jack, and lug wrench from your car's trunk or storage area. Place the jack under the designated lifting point nearest to the flat tire - check your owner's manual for exact location.\r\n3. Use the lug wrench to loosen the lug nuts on the flat tire by turning them counterclockwise, but don't remove them completely yet. Do this while the tire is still on the ground for easier leverage.\r\n4. Raise the car with the jack until the flat tire is completely off the ground, about 6 inches up. Make sure the car is stable and the jack is properly positioned.\r\n5. Remove the loosened lug nuts completely and take off the flat tire. Remember to place lug nuts in a secure location where they won't roll away.\r\n6. Mount the spare tire onto the wheel hub, aligning the holes with the wheel studs. Replace the lug nuts and tighten them by hand in a star pattern.\r\n7. Lower the car back down until the spare tire touches the ground but the car's weight isn't fully on it. Tighten the lug nuts completely with the wrench in a star pattern.\r\n8. Lower the car completely and remove the jack. Double-check all lug nuts for tightness. Store the flat tire and all tools back in your car.\r\n9. Drive at the recommended speed limit for your spare tire (usually under 50 mph) and get your flat tire repaired or replaced as soon as possible.",
            "CategoryId": 3
          }
    
]

